In [1]:
import pandas as pd

In [2]:
s1 = pd.Series(range(10, 91, 10))
s1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [3]:
s2 = sum(s1.values > 50)
s2

4

In [4]:
s3 = pd.Series({"철수" : 88,
                "영희" : 95,
                "길동" : 100,
                "몽룡" : 67
               })
s3.name = "사회 시험점수"
s3.index.name = "이름"

s3

이름
철수     88
영희     95
길동    100
몽룡     67
Name: 사회 시험점수, dtype: int64

In [5]:
s4 = pd.Series({"서울": 9_904_312,
                "부산": 3_448_737,
                "인천": 2_890_451,
                "대구": 2_466_052
                })
s4

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [6]:
for k, v in s4.items():
    if v > 3_000_000:
        print(f"{k}의 인구는 300만이 넘습니다.")

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [7]:
# 인천의 인덱스와 값을 시리즈로 조회하기

In [8]:
s4[["인천"]]

인천    2890451
dtype: int64

In [9]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
             index = ["서울", "부산", "인천", "대구"])
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [10]:
s2 = pd.Series({"서울" : 9631482,
                "부산" : 3393191,
                "인천" : 2632035,
                "대전" : 1490158
                })
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [11]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]

rs[[rs.values.argmax()]]
# 하나의 값을 Series로 생성

인천    9.818107
dtype: float64

In [12]:
rs[ rs==rs.max() ]

인천    9.818107
dtype: float64

In [13]:
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [14]:
rs["부산":"인천"] = (1.63, 2.83, 9.82)
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [15]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자": 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

In [16]:
ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(data = fin2_value, index = fin2_index)

In [17]:
display(ser_finance1, ser_finance2)

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [18]:
ser_finance1 - ser_finance2
# NaN이 LG전자와 네이버에서 발생하므로 전체 dtype이 float으로 변경

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [19]:
ser_finance1 + ser_finance2
# NaN이 LG전자와 네이버에서 발생하므로 전체 dtype이 float으로 변경

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [20]:
ser_finance1 * ser_finance2
# NaN이 LG전자와 네이버에서 발생하므로 전체 dtype이 float으로 변경

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [21]:
ser_finance1 / ser_finance2
# NaN이 LG전자와 네이버에서 발생하므로 전체 dtype이 float으로 변경
# 그리고 나눗셈은 무조건 float으로 dtype 변경

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [22]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64